
namespace Lab_1_test
{
    public class ConsoleMenu
    {
        public ConsoleMenu()
        {
            Console.WriteLine(
                "1.Вивести робітників в алфавітному порядку за прізвищем.\n" +
                "2.Вивести робітників, які є магістрами.\n" +
                "3.Вивести найменшу зарплату .\n" +
                "4.Вивести в оберненому порядку список робітників, які працюють більше n років\n" +
                "5.Повернути середню зарплату працівників.\n" +
                "6.Вивести робітників з найбільшою заробітною платнею за весь період роботи.\n" +
                "7.Знайти кількість працівників, чия заробітна платня перевищує n грн.\n" +
                "8.Вивести записи про зарплату за місяць в порядку спадання номеру облікової картки.\n" +
                "9.Вивести назви компаній, у верхньому регістрі.\n" +
                "10.Вивести кількість робітників, які народилися до n року.\n" +
                "11.Згрупувати людей за спеціальністю.\n" +
                "12.Вибрати першого робітника зі списку, відсортованого по імені.\n" +
                "13.Перезаписати ПІБ працівників у нижній регістр.\n" +
                "14.Об'єднати списки працівників та списки зарплатень по номеру облікової картки платника податків, вивести останню зарплатню.\n" +
                "15.Вивести всіх роботодавців до певного id компанії.\n" +
                "16.Видалити дублікати працівників зі списку про працевлаштування.\n" +
                "17.Чи існують в списку працівників, люди з певною спеціальністю.\n" +
                "18.Об'єднати 2 списки з даними про працівників.\n" +
                "19.Знайти прізвища що починаються на 'Ш'.\n"+
                "20.Чи всі працівники у списку мають однакову зарплатню n.\n");
        }
    }
}
